src/Documents/ПриобретениеТоваровИУслуг/ПриобретениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриобретениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиДенег</registerRecords>
  <registerRecords>InformationRegister.Себестоимость</registerRecords>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУслуг</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДоходовоИРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Себестоимость/Себестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Себестоимость</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаЗаЕдиницу</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ОстаткиДенег/ОстаткиДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДенег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Касса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовоИРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ЦеныПоставщиков/ЦеныПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоставщиков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПриобретениеТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	УстановкаЦенИзДокументовПоступления = Константы.УстановкаЦенИзДокументовПоступления.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПриобретениеТоваровИУслугТовары.Количество) КАК Количество,
		|	СУММА(ПриобретениеТоваровИУслугТовары.Цена) КАК Цена,
		|	СУММА(ПриобретениеТоваровИУслугТовары.Сумма) КАК Стоимость
		|ИЗ
		|	Документ.ПриобретениеТоваровИУслуг.Товары КАК ПриобретениеТоваровИУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровИУслугТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровИУслугТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СуммаУслугКРаспределению = Услуги.Итог("Сумма") / Выборка.Количество();
	
	//Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Себестоимость.Записывать = Истина;
	Движения.ОстаткиДенег.Записывать = Истина;
	
	Если УстановкаЦенИзДокументовПоступления Тогда
		
		Движения.ЦеныПоставщиков.Записывать = Истина;
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Цена = Выборка.Стоимость + СуммаУслугКРаспределению;
		ЦенаЗаЕдиницу = Цена / Выборка.Количество;
		
		// регистр ОстаткиТоваров Приход
		//Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		//Движение.Период = Дата;
		//Движение.Номенклатура = Выборка.Номенклатура;
		//Движение.Количество = Выборка.Количество;
		
		// регистр Себестоимость
		Движение = Движения.Себестоимость.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.ЦенаЗаЕдиницу = ЦенаЗаЕдиницу;
		
		
		Если УстановкаЦенИзДокументовПоступления Тогда
			
			Движение = Движения.ЦеныПоставщиков.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Поставщик = Контрагент;
			Движение.Цена = Выборка.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движение = Движения.ОстаткиДенег.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Касса = Касса;
	Движение.Сумма = СуммаДокумента;
	Движение.СтатьяДоходовИРасходов = Статья;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Товары.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните список товаров";
		Сообщение.Сообщить();
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	СуммаУслуг = Услуги.Итог("Сумма");
	
КонецПроцедуры
